Revit 2027 API
IFCConnectedWallData.ElementId Property
 The element id to which this element is joined.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ElementId { get; }
Public ReadOnly Property ElementId As ElementId
	Get
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
member ElementId : ElementId with get
Property Value
ElementId
See Also
Reference
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace